'''
На вход программы поступает целое число — порядковый номер месяца. 
Напишите программу, которая выводит построчно названия месяца и время года, 
к которому этот месяц относится. Названия месяца и времени года должны выводиться с маленькой буквы.

Если вводимое число не попадает в диапазон [1; 12], программа выводит “ошибка”.
'''

def f(n):
    if n > 12 or n < 1:
        print("ошибка")
        return
    if n < 3: s = "зима"
    elif n < 6: s = "весна"
    elif n < 9: s = "лето"
    elif n < 12: s = "осень"
    else: s = "зима"

    match n:
        case 1: print(f"январь\n{s}")
        case 2: print(f"февраль\n{s}")
        case 3: print(f"март\n{s}")
        case 4: print(f"апрель\n{s}")
        case 5: print(f"май\n{s}")
        case 6: print(f"июнь\n{s}")
        case 7: print(f"июль\n{s}")
        case 8: print(f"август\n{s}")
        case 9: print(f"сентябрь\n{s}")
        case 10: print(f"октябрь\n{s}")
        case 11: print(f"ноябрь\n{s}")
        case 12: print(f"декабрь\n{s}")
    

n = int(input())
f(n)



'''
n = int(input())

months = ["январь", "февраль", "март", "апрель", "май", "июнь",
          "июль", "август", "сентябрь", "октябрь", "ноябрь", "декабрь"]
seasons = ["весна", "лето", "осень", "зима"]

if 1 <= n <= 12:
    print(months[n - 1])
    print(seasons[(n % 12) // 3])
else:
    print("ошибка")
'''

'''
months = "январь февраль март апрель май июнь июль август сентябрь октябрь ноябрь декабрь".split()
seasons = ["зима"]*2 + ["весна"]*3 + ["лето"]*3 + ["осень"]*3 + ["зима"]

if 1 <= n <= 12:
    print(months[n - 1], seasons[n - 1], sep="\n")
else:
    print("ошибка")
'''