'''
Напишите программу для расчета времени для накопления нужной суммы на депозите. 
Каждый месяц проценты добавляются к сумме вклада, в следующий месяц процент рассчитывается на увеличенную в предыдущем месяце сумму вклада.

Входными данными для программы являются три числа: начальная сумма, требуемая сумма, процентная ставка в месяц. 
Все три значения являются числами с плавающей точкой.

Результатом выполнения программы будет целое число месяцев, за которое накопится требуемая сумма.

Например:

Ввод	Результат
1000    12
1250
2

'''

def f(start_sum, need_sum, rate):
    if rate <= 0: return
    curr_sum = start_sum
    periods = 0
    while curr_sum < need_sum:
        curr_sum *= (1 + rate / 100)
        periods += 1 
    return periods

start_sum = float(input())
need_sum = float(input())
rate = float(input())

print(f(start_sum, need_sum, rate))